const questions = [
  {
    id: 1,
    scenario: '你受邀參加一場精緻的茶道表演，茶藝師傅手法獨到，展現出不同的茶道魅力。',
    prompt: '當輪到你品嚐茶時，你會選擇：',
    options: {
      A: '靜靜品味，沉浸在茶香之中。',
      B: '與身邊的朋友分享茶的美好，一同歡笑。',
    },
  },
  {
    id: 2,
    scenario: '表演舉辦在一家古老的茶莊中，四周瀰漫著濃厚的茶香，茶莊主人熱情地邀請你參觀莊園。',
    prompt: '你會選擇：',
    options: {
      A: '到處閒晃，看到什麼感興趣的就湊過去。',
      B: '按照導覽圖上的推薦路線參觀。',
    },
  },
  {
    id: 3,
    scenario: '你在寧靜的山谷中遇到了一位隱士，他正在泡製一種神秘的草本茶。他邀請你品嚐這種獨特的茶，並表示這是一種能增進內在平靜的茶。',
    prompt: '你會：',
    options: {
      A: '感受這種草本茶的能量，並努力保持冥想狀態。',
      B: '詢問隱士這種茶的成分，希望了解背後的科學原理。',
    },
  },
  {
    id: 4,
    scenario: '你在古老的亭子中遇見一位披著斗篷的賢者。她倒出一杯七彩的茶，並告訴你這是一種具有魔力的茶。她邀請你品嚐。',
    prompt: '你會：',
    options: {
      A: '試試也無妨，萬一真的有魔力呢？',
      B: '打從心底覺得自己不會喜歡它的味道，因此婉拒。',
    },
  },
]

export default questions
